BIF_CFMesh/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet1
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    Wall
    {
        type            calculated;
        value           nonuniform List<vector> 
40276
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet2
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet3
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet4
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
