BIF_CFMesh/system/unitSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  dev                                   |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
actions
(
	{
		name    unit1CellSet;
		type    cellSet;
		action  new;
		source  boxToCell;
		sourceInfo
		{
			box (-0.003 0.027 -1.0) (-0.002 0.028 1.0);
		}
	}
	{
		name    unit1;
		type    cellZoneSet;
		action  new;
		source  setToCellZone;
		sourceInfo
		{
			set unit1CellSet;
		}
	}
);
// ************************************************************************* //
